Revit 2027 API
GlobalParameter.IsReporting Property
 Indicates whether this is a reporting global parameter or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsReporting { get; set; }
Public Property IsReporting As Boolean
	Get
	Set
public:
property bool IsReporting {
	bool get ();
	void set (bool value);
}
member IsReporting : bool with get, set
Property Value
Boolean
 True if the parameter is reporting, False otherwise.
Exceptions
Exception | Condition
ArgumentException |  When setting this property: This is a formula-driven parameter. As such it does not allow the current operation. -or- When setting this property: This non-reporting global parameter has already labeled other dimensions (more then 1). It cannot, therefore, be made reporting and dimension-driven before un-labeling all the dependent dimensions first. -or- When setting this property: The global parameter is not of a type that may be used with reporting. Generally, a reporting parameter must be either of type Length or Angle. -or- When setting this property: Currently reporting parameters may not be changed if they are driven by a dimension that cannot have its value set by a global parameter, such as an arc-length, locked, or multi-segment dimension.
Remarks
When a global parameter is declared as reporting, it takes its value from the one driving dimension it is set to label. To be declared as reporting, a parameter must be labeling no more than one single-segment dimension. If a global parameter is not labeling any dimensions at the time it is declared as reporting, its value stays unchanged until a driving dimension is labeled with it.
Reporting parameters can be (currently) only of type Length or Angle, but programmers can always call the HasValidTypeForReporting() first when in doubt about whether a global parameter has a data type eligible for reporting.
See Also
Reference
GlobalParameter Class
Autodesk.Revit.DB Namespace